{
    "title": "How to grow parsley",
    "image": "https://images.immediate.co.uk/production/volatile/sites/10/2018/02/b8ae7840-df95-4fc3-97a3-58ddca80a570-a05b6a4.jpg?webp=true&quality=90&resize=940%2C626",
    "description": "Grow curled and flat-leaf parsley in moist but well-drained soil in sun to partial shade. Harvest the leaves as and when you need to. Sow seed every few weeks for a successional harvest. Parsley is biennial and treated as an annual, so you'll need to sow fresh seed every year.\n\nMore on growing parsley:\n\n    Thyme, parsley and chive herb pot\n    Eight shade-loving herbs to grow\n    Seven projects for a winter greenhouse\n\nFind out how to grow parsley in our Grow Guide.\n\nHow to sow parsley seeds\n\nSow parsley seeds directly into well-prepared soil, in rows 1cm deep and 30cm apart. Lightly cover the seeds and water in well. When seedlings are large enough, thin them to 15cm apart.\n\nAlternatively, if you have less space available, fill a pot with seed compost and sow seeds thinly, covering with a light layer of compost and watering in. Make sure the compost does not dry out. Seeds can take six weeks to germinate and should be thinned out and potted on when big enough. When moving to a larger pot, use a mix of garden and soil-based compost, to prevent the young plants from drying out.\n\nSow batches of seeds a few weeks apart so you have a continuous supply of parsley.\n\nWatch this clip from Gardeners' World to find out what conditions parsley needs, how far apart to space the plants, and how to harvest the leaves:\n\nHow to care for parsley\n\nParsley needs plenty of water, particularly during dry weather, and benefits from the occasional feed of general seaweed fertiliser to boost leafy growth. Cut back any yellowing foliage.\n\nA biennial plant, flowers will be produced in the second year, if plants are not regularly cut back. If you want to save seed, allow some plants to flower.\n\nHow to harvest parsley\n\nParsley leaves can be dried and stored, but the flavour is less intense. With parsley plants so easy to grow and maintain, it makes sense to use a fresh supply. In terms of flavour, it's better to chop parsley finely in a food processor and freeze if you do want to store for later use. You can pot up plants at the end of the season and bring them indoors for leaves throughout winter.\n\nCooking with parsley\n\nParsley can be added to a wide range of recipes from soups and stews to omelettes and Middle Eastern salads like tabbouleh. It's best finely chopped and both leaves and stems can be used.\n\nGrowing parsley: problem solving\n\nParsley is in the carrot family and therefore can be prone to some of the pests that affect carrots such as carrot fly. So take similar precautions, such as companion planting with garlic or onions. Also protect parsley seedlings from slugs and snails.\n\nParsley varieties to grow\n\n    Petroselinum crispum 'Aphrodite' - has good-flavoured dark green leaves with a tight curl, often used as a garnish\n    Petroselinum crispum 'French' - with flat, deep-green leaves, it has a stronger parsley flavour than the curled varieties and is preferred for cooking\n    Petroselinum crispum 'Titan' - a flat-leaved or French variety, with small, deep-green leaves and a strong, sweet parsley flavour\n    Petroselinum crispum 'Envy' - has dark green tightly curled leaves and is also very ornamental\n    Petroselinum crispum 'Gigante Napoletano' - as the name suggests, the leaves are large, and also very aromatic\n\n"
}